gemi254/ConfigAssist-ESP32-ESP8266/src/configAssist.cpp
#include <Arduino.h>
#include <vector>
#include <regex>
#include <ArduinoJson.h>
#if defined(ESP32)
  #include <WebServer.h>
  #include "SPIFFS.h"
  #include <ESPmDNS.h>
  #include <SD_MMC.h>
#else
  #include <LittleFS.h>
  #include <ESP8266WiFi.h>
  #include <WiFiClient.h>
  #include <ESP8266WebServer.h>
  #include <ESP8266mDNS.h>
  #include "TZ.h"
#endif
#include <FS.h>

#include "configAssistPMem.h" //Memory static valiables (html pages)
#include "configAssist.h"

WEB_SERVER *ConfigAssist::_server = NULL;
String ConfigAssist::_jWifi="[{}]";

ConfigAssist::ConfigAssist() {
  _jsonLoaded = false; _iniValid=false; _confFile = DEF_CONF_FILE; _apEnabled=false;
}

ConfigAssist::ConfigAssist(String ini_file) {  
      _jStr = NULL;  _jsonLoaded = false; _iniValid = false; _dirty = false; 
      if (ini_file != "") _confFile = ini_file;
      else _confFile = DEF_CONF_FILE; 
      init( _confFile );
    }
    
ConfigAssist::~ConfigAssist() {}

// Initialize with an ini filename
void ConfigAssist::init(String ini_file) { 
  _jStr = NULL;
  if(ini_file!="") _confFile = ini_file;
  loadConfigFile(_confFile);
  //On fail load defaults from dict  = DEF_CONF_FILE
  if(!_iniValid){
    _dirty = true;
  }      
}

// Editable Ini file, with json dict
void ConfigAssist::init(String ini_file, const char * jStr) { 
  if(jStr) _jStr = jStr;
  else _jStr = appDefConfigDict_json;

  if(ini_file!="") _confFile = ini_file;
  loadConfigFile(_confFile); 
  
  //On fail load defaults from dict
  if(!_iniValid){
    LOG_WRN("File : %s is not Valid. Loading default values\n",_confFile.c_str());
    loadJsonDict(_jStr);
    _dirty = true;
  }      
}

// Dictionary only, default ini file
void ConfigAssist::initJsonDict(const char * jStr) { 
  init(_confFile,  jStr);
}
bool ConfigAssist::valid(){ return _iniValid;}
bool ConfigAssist::exists(String variable){ return getKeyPos(variable) >= 0; }            
    
// Start an AP with a web server and render config values loaded from json dictionary
void ConfigAssist::setup(WEB_SERVER &server, bool apEnable ){
  String hostName = getHostName();      
  LOG_INF("ConfigAssist setup webserver\n");
  _server = &server;
  if(apEnable){
    WiFi.mode(WIFI_AP_STA);
    WiFi.softAP(hostName.c_str(),"",1);
    LOG_INF("Wifi AP SSID: %s started, use 'http://%s' to connect\n", WiFi.softAPSSID().c_str(), WiFi.softAPIP().toString().c_str());      
    if (MDNS.begin(hostName.c_str()))  LOG_INF("AP MDNS responder Started\n");  
    server.begin();
    _apEnabled = true;
  }
  if(USE_WIFISCAN)  startScanWifi();      
  server.on("/cfg",[this] { this->handleFormRequest(this->_server);  } );
  server.on("/scan", [this] { this->handleWifiScanRequest(); } );
  server.onNotFound([this] { this->handleNotFound(); } );
  LOG_DBG("ConfigAssist setup done. %x\n", this);      
}

// Implement operator [] i.e. val = config['key']    
String ConfigAssist::operator [] (String k) { return get(k); }     
    
// Get a temponary hostname
String ConfigAssist::getMacID(){
  String mac = WiFi.macAddress();
  mac.replace(":","");
  return mac.substring(6);
}

// Get a temponary hostname
String ConfigAssist::getHostName(){
  String hostName = get(HOSTNAME_KEY);
  if(hostName=="") hostName = "ESP_ASSIST_" + getMacID();
  else hostName.replace("{mac}", getMacID());
  return hostName;
}

// Return the value of a given key, Empty on not found
String ConfigAssist::get(String variable) {
  int keyPos = getKeyPos(variable);
  if (keyPos >= 0) {
    return _configs[keyPos].value;        
  }
  return String(""); 
}
    
// Update the value of thisKey = value (int)
bool ConfigAssist::put(String thisKey, int value, bool force) {
    return  put(thisKey, String(value), force); 
} 
    
// Update the value of thisKey = value (string)
bool ConfigAssist::put(String thisKey, String value, bool force) {      
  int keyPos = getKeyPos(thisKey);      
  if (keyPos >= 0) {
    //Save 0,1 on booleans
    if(_configs[keyPos].type == CHECK_BOX){
      value = String(IS_BOOL_TRUE(value));
    }
    //LOG_DBG("Check : %s, %s\n", _configs[keyPos].value.c_str(), value.c_str());
    if(_configs[keyPos].value != value){
      LOG_DBG("Put %s=%s\n", thisKey.c_str(), value.c_str()); 
      _configs[keyPos].value = value;
      _dirty = true;
    }
    return true;
  }else if(force) {
      add(thisKey, value);
      sort();
      _dirty = true; 
      return true;
  }else{
    LOG_ERR("Put failed on Key: %s=%s\n", thisKey.c_str(), value.c_str());
  } 
  return false;    
}
    
// Add vectors by key (name in confPairs)
void ConfigAssist::add(String key, String val){      
  confPairs d = {key, val, "", "", -1 , TEXT_BOX };
  //LOG_DBG("Adding key %s=%s\n", key.c_str(), val.c_str()); 
  _configs.push_back(d);
}

// Add vectors pairs
void ConfigAssist::add(confPairs &c){
    //LOG_DBG("Adding key[%i]: %s=%s\n", readNo, key.c_str(), val.c_str()); 
  _configs.push_back({c}) ;
}

// Add seperator by key
void ConfigAssist::addSeperator(String key, String val){
    //LOG_DBG("Adding sep key: %s=%s\n", key.c_str(), val.c_str()); 
  _seperators.push_back({key, val}) ;      
}

// Sort vectors by key (name in confPairs)
void ConfigAssist::sort(){
  std::sort(_configs.begin(), _configs.end(), [] (
    const confPairs &a, const confPairs &b) {
    return a.name < b.name;}
  );
}

// Sort seperator vectors by key (name in confSeperators)
void ConfigAssist::sortSeperators(){
  std::sort(_seperators.begin(), _seperators.end(), [] (
    const confSeperators &a, const confSeperators &b) {
    return a.name < b.name;}
  );
}

// Sort vectors by readNo in confPairs
void ConfigAssist::sortReadOrder(){
  std::sort(_configs.begin(), _configs.end(), [] (
    const confPairs &a, const confPairs &b) {
    return a.readNo < b.readNo;}
  );
}

// Return next key and value from configs on each call in key order
bool ConfigAssist::getNextKeyVal(confPairs &c) {
  static uint8_t row = 0;
  if (row++ < _configs.size()) { 
      c = _configs[row - 1];
      return true;
  }
  // end of vector reached, reset
  row = 0;
  return false;
}

// Get the configuration in json format
String ConfigAssist::getJsonConfig(){
  confPairs c;
  String j = "{";
  while (getNextKeyVal(c)){
      j += "\"" + c.name + "\": \"" + c.value + "\",";          
  }
  if(j.length()>1) j.remove(j.length() - 1);
  j+="}";
  return j;
}

// Display config items
void ConfigAssist::dump(){
  confPairs c;
  while (getNextKeyVal(c)){
      LOG_INF("[%u]: %s = %s; %s; %i\n", c.readNo, c.name.c_str(), c.value.c_str(), c.label.c_str(), c.type );
  }
}
    
// Load json description file. On update=true update only additional pair info    
int ConfigAssist::loadJsonDict(String jStr, bool update) { 
  if(jStr==NULL) return -1; 
  DeserializationError error;
  const int capacity = JSON_ARRAY_SIZE(MAX_PARAMS)+ MAX_PARAMS*JSON_OBJECT_SIZE(8);
  DynamicJsonDocument doc(capacity);
  error = deserializeJson(doc, jStr.c_str());
  
  if (error) { 
    LOG_ERR("Deserialize Json failed: %s\n", error.c_str());
    _jsonLoaded = false;   
    return -1;    
  }
  //Parse json description
  JsonArray array = doc.as<JsonArray>();
  int i=0;
  for (JsonObject  obj  : array) {                
    confPairs c = {"", "", "", "", 0, 1};        
    if (obj.containsKey("name")){
      String k = obj["name"];
      String l = obj["label"];
      c.name = k;
      c.label = l;
      c.attribs ="";
      c.readNo = i;
      if (obj.containsKey("options")){       //Options list
        String d = obj["default"];
        String o = obj["options"];
        c.value = d;
        c.attribs = o;
        c.type = OPTION_BOX;
      }else if (obj.containsKey("datalist")){ //Combo box
        String d = obj["default"];
        String l = obj["datalist"];
        c.value = d;
        c.attribs = l;
        c.type = COMBO_BOX;            
        }else if (obj.containsKey("range")){  //Input range
        String d = obj["default"];
        String r = obj["range"];
        c.value = d;
        c.attribs = r;
        c.type = RANGE_BOX;
      }else if (obj.containsKey("file")){   //Text area
        String f = obj["file"];
        c.value = f;            
        if(obj.containsKey("default")){
          String d = obj["default"];
          c.attribs = d;
        }
        c.type = TEXT_AREA;
      }else if (obj.containsKey("checked")){ //Check box
        String ck = obj["checked"];
        c.value = ck;
        c.type = CHECK_BOX;
      }else if (obj.containsKey("default")){ //Edit box
        String d = obj["default"];
        c.value = d;
        if(obj.containsKey("attribs")){
          String a = obj["attribs"];
          c.attribs = a;
        } 
        c.type = TEXT_BOX;
      }else{
        LOG_ERR("Undefined value on param : %i.", i);
      }  

