gemi254/ConfigAssist-ESP32-ESP8266/src/configAssist.cpp
      if (c.type) { //Valid
        if(update){
          int keyPos = getKeyPos(c.name);
          //Add a Json key if not exists in ini file
          if (keyPos < 0) {
            LOG_WRN("Key: %s not found in ini file.\n", c.name.c_str());
            put(c.name, c.value,true);
            keyPos = getKeyPos(c.name);
          }
          if (keyPos >= 0) {
            //Update all other fields but not value,key        
            _configs[keyPos].readNo = i;
            _configs[keyPos].label = c.label;
            _configs[keyPos].type = c.type;
            _configs[keyPos].attribs = c.attribs;
            LOG_DBG("Json upd key[%i]=%s, type:%i, read: %i\n", keyPos, c.name.c_str(), c.type, i);
          }else{
            LOG_ERR("Undefined json Key: %s\n", c.name.c_str());
          }
        }else{
          LOG_DBG("Json add: %s, val %s, read: %i\n", c.name.c_str(), c.value.c_str(), i);                         
          add(c);
        }
        i++;
      }

    }else if (obj.containsKey("seperator")){
      String sepNo = "sep_" + String(i);
      String val =  obj["seperator"];
      addSeperator(sepNo, val);          
    }else{
      LOG_ERR("Undefined keys name/default on param : %i.", i);
    }
  }
  //sort vector for binarry search
  sort();
  sortSeperators();
  _jsonLoaded = true;
  LOG_INF("Loaded json dict\n");
  return i;
}
     
// Load config pairs from an ini file
bool ConfigAssist::loadConfigFile(String filename) {
  LOG_DBG("Loading config: %s\n",filename.c_str());
  if(filename=="") filename = _confFile;
  File file = STORAGE.open(filename,"r");
  if (!file){
    LOG_ERR("File: %s not exists!\n", filename.c_str());
    _iniValid = false;       
    return false;  
  }else if(!file.size()) {
    LOG_ERR("Failed to load: %s, size: %u\n", filename.c_str(), file.size());
    //if (!file.size()) STORAGE.remove(CONFIG_FILE_PATH); 
    _iniValid = false;       
    return false;
  }else{
    _configs.reserve(MAX_PARAMS);
    // extract each config line from file
    while (file.available()) {
      String configLineStr = file.readStringUntil('\n');
      LOG_DBG("Load: %s\n" , configLineStr.c_str());          
      loadVectItem(configLineStr);
    } 
    sort();
  }
  
  file.close();
  LOG_INF("Loaded config: %s, keyCnt: %i\n",filename.c_str(), _configs.size());
  _iniValid = true;
  return true;
}

// Delete configuration file
bool ConfigAssist::deleteConfig(String filename){
  if(filename=="") filename = _confFile;
  LOG_INF("Removing config: %s\n",filename.c_str());
  return STORAGE.remove(filename);
}

// Save configs vectors in an ini file
bool ConfigAssist::saveConfigFile(String filename) {
  if(filename=="") filename = _confFile;
  if(!_dirty){
    LOG_INF("Alread saved: %s\n", filename.c_str() );
    return true;
  } 
  File file = STORAGE.open(filename, "w+");
  if (!file){
    LOG_ERR("Failed to save config file\n");
    return false;
  }
  //Save config file with updated content
  size_t szOut=0;
  for (auto& row: _configs) {
    if(row.name==HOSTNAME_KEY){
      row.value.replace("{mac}", getMacID());
    }
    char configLine[512];
    sprintf(configLine, "%s%c%s\n", row.name.c_str(), INI_FILE_DELIM, row.value.c_str());   
    szOut+=file.write((uint8_t*)configLine, strlen(configLine));
    LOG_DBG("Saved: %s = %s, type: %i\n", row.name.c_str(), row.value.c_str(), row.type);
  }
  LOG_INF("File saved: %s, sz: %u B\n", filename.c_str(), szOut);
  file.close();
  _dirty = false;
  return true;
}
// Get system local time
String ConfigAssist::getLocalTime() {      
  struct timeval tv;
  gettimeofday(&tv, NULL);
  time_t currEpoch = tv.tv_sec;
  char timeFormat[20];
  strftime(timeFormat, sizeof(timeFormat), "%d/%m/%Y %H:%M:%S", localtime(&currEpoch));
  return String(timeFormat);
}
    
// Compare browser with system time and correct if needed
void ConfigAssist::checkTime(uint32_t timeUtc, int timeOffs){
  struct timeval tvLocal;
  gettimeofday(&tvLocal, NULL);
  
  long diff = (long)timeUtc - tvLocal.tv_sec;
  LOG_DBG("Remote utc: %lu, local: %lu\n", timeUtc, tvLocal.tv_sec);
  LOG_DBG("Time diff: %u\n",diff);      
  if( abs(diff) > 5L ){ //5 Secs
    LOG_DBG("LocalTime: %s\n", getLocalTime().c_str());          
    struct timeval tvRemote;
    tvRemote.tv_usec = 0;
    tvRemote.tv_sec = timeUtc;
    settimeofday(&tvRemote, NULL);
    String tmz;
    if(getKeyPos(TIMEZONE_KEY) >= 0) tmz = get(TIMEZONE_KEY);
    if(tmz==""){
      String tmz = "GMT";
      if(timeOffs >= 0) tmz += "+" + String(timeOffs);
      else tmz += String(timeOffs);
    } 
    setenv("TZ", tmz.c_str(), 1);
    tzset();
    LOG_INF("LocalTime after sync: %s, tmz=%s\n", getLocalTime().c_str(), tmz.c_str());
    
  }      
}

// Respond a HTTP request for /scan results
void ConfigAssist::handleWifiScanRequest(){
  checkScanRes();   _server->sendContent(_jWifi); 
}
// Test Station connections
String ConfigAssist::testWiFiSTConnection(String no){
  String msg = "";
  String ssid = get("st_ssid"+no);
  String pass = get("st_pass"+no);
  if(ssid != "" && WiFi.status() != WL_CONNECTED){
    //Connect to Wifi station with ssid from conf file
    uint32_t startAttemptTime = millis();
    if(WiFi.getMode()!=WIFI_AP_STA) WiFi.mode(WIFI_AP_STA);
    LOG_DBG("Wifi Station testing :%s, %s\n", no, ssid.c_str());
    WiFi.begin(ssid.c_str(), pass.c_str());
    while (WiFi.status() != WL_CONNECTED && millis() - startAttemptTime < 15000)  {
      Serial.print(".");
      delay(500);
      Serial.flush();
    }  
    Serial.println();    
  }
  msg = "{";
  if(WiFi.status() != WL_CONNECTED){
    msg += "\"status\": \"Error\", ";
    msg += "\"ssid\": \"" + ssid + "\", ";
    msg += "\"code\": \"" + String(WiFi.status()) + "\"";
  }else if(ssid != WiFi.SSID()){ //Connected and test other ssid
    msg += "\"status\": \"Failed\", ";
    msg += "\"ssid\": \"" + ssid + "\", ";
    msg += "\"code\": \"" + String("Already in connection") + "\"";  
  }else{
    msg += "\"status\": \"Success\", ";
    msg += "\"ip\": \"" + WiFi.localIP().toString()+ "\", ";
    msg += "\"ssid\": \"" + WiFi.SSID() + "\", ";
    msg += "\"rssi\": \"" + String(WiFi.RSSI()) + " db\"";
  }
  
