gemi254/ConfigAssist-ESP32-ESP8266/src/configAssist.cpp
  msg += "}"; 
  LOG_DBG("Wifi Station testing: %s\n", msg.c_str() );
  return msg;
}

// Respond a not found HTTP request
void ConfigAssist::handleNotFound(){
  _server->send ( 200, "text/html", "<meta http-equiv=\"refresh\" content=\"0;url=/cfg\">");
}

// Respond a HTTP request for the form use the CONF_FILE
// to save. Save, Reboot ESP, Reset to defaults, cancel edits
void ConfigAssist::handleFormRequest(WEB_SERVER * server){
  if(server == NULL ) server = _server;
  //Save config form
  if (server->args() > 0) {
    server->setContentLength(CONTENT_LENGTH_UNKNOWN);        
    //Discard edits and load json defaults;
    if (server->hasArg(F("_RST"))) {
      deleteConfig();
      _configs.clear();
      loadJsonDict(_jStr);
      //saveConfigFile(CONF_FILE);
      LOG_INF("_iniValid: %i\n", _iniValid);
      if(!_iniValid){
        server->send(200, "text/html", "Failed to load config.");
      }else{
        server->send ( 200, "text/html", "<meta http-equiv=\"refresh\" content=\"0;url=/cfg\">");
      }
      server->client().flush(); 
      return;
    }      
    //Reload and loose changes
    if (server->hasArg(F("_CANCEL"))) {
      server->send ( 200, "text/html", "<meta http-equiv=\"refresh\" content=\"0;url=/\">");
      return;
    }
    //Test wifi?    
    if (server->hasArg(F("_TEST_WIFI"))) {
      LOG_DBG("Testing WIFI ST connection..\n");
      String no = server->arg(F("_TEST_WIFI"));
      String msg = testWiFiSTConnection(no);
      server->send(200, "text/json", msg.c_str());
      server->client().flush(); 
      LOG_DBG("Testing WIFI ST connection..Done\n");
      if(_apEnabled) WiFi.disconnect();
      return;
    }

    //Reboot esp?    
    if (server->hasArg(F("_RBT_CONFIRM"))) {
      LOG_DBG("Restarting..\n");
      server->send(200, "text/html", "OK");
      server->client().flush(); 
      delay(1000);
      ESP.restart();
      return;
    }
    
    //Update configs from form post vals
    String reply = "";
    for(uint8_t i=0; i<server->args(); ++i ){
      String key(server->argName(i));
      String val(server->arg(i));
      key = urlDecode(key);
      val = urlDecode(val);
      if(key=="apName" || key =="_SAVE" || key=="_RST" || key=="_RBT" || key=="plain" || key=="_TS") continue;
      if(key.endsWith(FILENAME_IDENTIFIER)) continue;
      if(key=="clockUTC"){
          // Synchronize to browser clock if out of sync
          String offs("0");
          if(server->hasArg("offs")){
            offs = String(server->arg("offs"));
          }
          checkTime(val.toInt(), offs.toInt());
          server->send(200, "text/html", "OK");
          return;
      }
      //Check if if text box with file name
      String fileNameKey = server->argName(i) + FILENAME_IDENTIFIER;
      if(server->hasArg(fileNameKey)){
          String fileName = server->arg(fileNameKey);
          saveText(fileName, val);
          val = fileName;
      }
      LOG_DBG("Form upd: %s = %s\n", key.c_str(), val.c_str());
      if(!put(key, val)) reply = "ERROR: " + key;
    }
    
    //Reboot esp
    if (server->hasArg(F("_RBT"))) {
        saveConfigFile();
        String out(CONFIGASSIST_HTML_MESSAGE);
        String timestamp = server->arg("_TS");
        bool reboot = true;
        if(timestamp != ""){
          struct timeval tvLocal;
          gettimeofday(&tvLocal, NULL);        
          //Is time in sync?
          if (tvLocal.tv_sec > 10000){            
            long timeUtc = timestamp.toInt();
            long diff = tvLocal.tv_sec - timeUtc;
            if( diff > 5L ) reboot = false;
            LOG_DBG("Check device reboot: %i, timeDif: %lu\n", reboot, diff );
          }else{
            LOG_DBG("Check device reboot: Time is not synchronized.\n");
          }          
        }
        if(!reboot){
          out.replace("{reboot}", "false");
          out.replace("{msg}", "Already restarted, Redirecting to home");
          out.replace("{refresh}", "3000");
        }else{
          out.replace("{reboot}", "true");          
          out.replace("{msg}", "Configuration saved.<br>Device will be restarted in a few seconds");
          out.replace("{refresh}", "10000");
        }
        out.replace("{title}", "Reboot device");
        out.replace("{url}", "/cfg");
        out.replace("{refresh}", "10000");
        server->send(200, "text/html", out);
        server->client().flush(); 
        return;
    }        
    //Save config file 
    if (server->hasArg(F("_SAVE"))) {
        if(saveConfigFile()) reply = "Config saved.";
        else reply = "ERROR: Failed to save config.";
        delay(100);
    }
    if(reply.startsWith("ERROR:"))
      server->send(500, "text/html", reply);            
    else
      server->send(200, "text/html", reply);
    return;
  }
  //Generate html page and send it to client
  sendHtmlEditPage(server);
}
    
// Send edit html to client
void ConfigAssist::sendHtmlEditPage(WEB_SERVER * server){
  LOG_DBG("Generate form, iniValid: %i, jsonLoaded: %i, dirty: %i\n", _iniValid, _jsonLoaded, _dirty);      
  //Load dictionary if no pressent
  if(!_jsonLoaded) loadJsonDict(_jStr, true);
  //Send config form data
  server->setContentLength(CONTENT_LENGTH_UNKNOWN);
  String out(CONFIGASSIST_HTML_START);
  out.replace("{host_name}", getHostName());
  server->sendContent(out);
  server->sendContent(CONFIGASSIST_HTML_CSS);
  server->sendContent(CONFIGASSIST_HTML_CSS_CTRLS);      
  String script(CONFIGASSIST_HTML_SCRIPT);
  
  if(USE_TESTWIFI){
    out = String("<script>") + CONFIGASSIST_HTML_SCRIPT_TEST_ST_CONNECTION + String("</script>");
    server->sendContent(out);
  }

  String subScript = "";
  if(USE_TIMESYNC) subScript += CONFIGASSIST_HTML_SCRIPT_TIME_SYNC;  
  if(USE_WIFISCAN) subScript += CONFIGASSIST_HTML_SCRIPT_WIFI_SCAN;
  //if(USE_TESTWIFI) subScript += CONFIGASSIST_HTML_SCRIPT_TEST_ST_CONNECTION;

  script.replace("/*{SUB_SCRIPT}*/", subScript);
  server->sendContent(script);
  out = String(CONFIGASSIST_HTML_BODY);
  out.replace("{host_name}", getHostName());
  server->sendContent(out);
  //Render html keys
  sortReadOrder();      
  while(getEditHtmlChunk(out)){
    server->sendContent(out);        
  }
  sort();
  out = String(CONFIGASSIST_HTML_END);
  out.replace("{appVer}", CLASS_VERSION);
  server->sendContent(out);
  //LOG_DBG("Generate form end\n");
}
    
//Get edit page html table (no form)
String ConfigAssist::getEditHtml(){
  sortReadOrder();      
  String ret = "";
  String out = "";
  while(getEditHtmlChunk(out)){
    ret += out;
  }
  sort();
  return ret;
}
// Get page css
String ConfigAssist::getCSS(){
  return String(CONFIGASSIST_HTML_CSS);
}
// Get browser time synchronization java script
String ConfigAssist::getTimeSyncScript(){
  return String(CONFIGASSIST_HTML_SCRIPT_TIME_SYNC);
}
// Get html custom message page
String ConfigAssist::getMessageHtml(){
  return String(CONFIGASSIST_HTML_MESSAGE);
}
// Is string numeric
bool ConfigAssist::isNumeric(String s){ //1.0, -.232, .233, -32.32
  unsigned int l = s.length();
  if(l==0) return false;
  bool dec=false, sign=false;
  for(unsigned int i = 0; i < l; ++i) {
    if (s.charAt(i) == '.'){
      if(dec) return false;
      else dec = true;
    }else if(s.charAt(i) == '+' || s.charAt(i) == '-' ){
      if(sign) return false;
      else sign = true;
    }else if (!isDigit(s.charAt(i))){
      //LOG_INF("%c\n", s.charAt(i));
      return false;
    }
  }
  return true;
}
    
